In [1]:
import sqlite3
import pandas as pd

from pathlib import Path

In [2]:
database_path="natural_disasters_db.sqlite"
Path(database_path).touch()

In [3]:
temp_df=pd.read_csv("temperaturedata.csv",dtype={"Year":str})

In [4]:
temp_df.info

<bound method DataFrame.info of        Year  Anomaly  Unnamed: 2  Unnamed: 3  \
0    198001     0.35         NaN         NaN
1    198002     0.43         NaN         NaN
2    198003     0.32         NaN         NaN
3    198004     0.33         NaN         NaN
4    198005     0.38         NaN         NaN
..      ...      ...         ...         ...
518  202303     1.23         NaN         NaN
519  202304     0.98         NaN         NaN
520  202305     0.96         NaN         NaN
521  202306     1.07         NaN         NaN
522  202307     1.12         NaN         NaN

    Global Land and Ocean Temperature Anomalies
0                        Units: Degrees Celsius
1                        Base Period: 1901-2000
2                                 Missing: -999
3                                           NaN
4                                           NaN
..                                          ...
518                                         NaN
519                                         NaN
520                                         NaN
521                                         NaN
522                                         NaN

[523 rows x 5 columns]>

In [5]:
#split "YYYYMM" column into "year" and "month" columns
temp_df['year']=temp_df['Year'].str[:4]
temp_df['month']=temp_df['Year'].str[4:]

In [6]:
#convert to numeric
temp_df['year']=pd.to_numeric(temp_df['year'])
temp_df['month']=pd.to_numeric(temp_df['month'])

In [7]:
temp_df.head()

,Year,Anomaly,Unnamed: 2,Unnamed: 3,Global Land and Ocean Temperature Anomalies,year,month
0,198001,0.35,NaN,NaN,Units: Degrees Celsius,1980,1
1,198002,0.43,NaN,NaN,Base Period: 1901-2000,1980,2
2,198003,0.32,NaN,NaN,Missing: -999,1980,3
3,198004,0.33,NaN,NaN,NaN,1980,4
4,198005,0.38,NaN,NaN,NaN,1980,5

In [8]:
selected_columns=['year','month','Anomaly']
temp_df[selected_columns]

     year  month  Anomaly
0    1980      1     0.35
1    1980      2     0.43
2    1980      3     0.32
3    1980      4     0.33
4    1980      5     0.38
..    ...    ...      ...
518  2023      3     1.23
519  2023      4     0.98
520  2023      5     0.96
521  2023      6     1.07
522  2023      7     1.12

[523 rows x 3 columns]

In [9]:
anomaly_df=temp_df[selected_columns]
anomaly_df.head()

   year  month  Anomaly
0  1980      1     0.35
1  1980      2     0.43
2  1980      3     0.32
3  1980      4     0.33
4  1980      5     0.38

In [11]:
anomaly_df["year"]=anomaly_df["year"].astype("int")

/var/folders/vq/0fk27r_d7fvdfvmppyp7ky6r0000gn/T/ipykernel_6704/568398089.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  anomaly_df["year"]=anomaly_df["year"].astype("int")

In [12]:
conn=sqlite3.connect(database_path)
c=conn.cursor()
c.execute('''CREATE TABLE temperature_anomalies(
    year INT,
    month INT,
    Anomaly FLOAT
    )''')
anomaly_df.to_sql("temperature_anomalies", conn, if_exists='append',index=False)

c.close()
conn.close()